nordic-auko/nRF5-ble-timesync-demo/ncs/timesync_sample/src/timesync/time_sync_nrf52.c
			switch (signal_type) {
			case MPSL_TIMESLOT_SIGNAL_SESSION_IDLE:
				err = mpsl_timeslot_session_close(session_id);
				if (err) {
					LOG_ERR("mpsl_timeslot_session_close=%d", err);
				}
				break;
			case MPSL_TIMESLOT_SIGNAL_SESSION_CLOSED:
				atomic_clear(&m_timeslot_session_open);
				atomic_clear(&m_pending_close);
				break;
			case MPSL_TIMESLOT_SIGNAL_BLOCKED:
			case MPSL_TIMESLOT_SIGNAL_CANCELLED:
				if (!m_pending_close)
				{
					int err;
					/* This is typically caused by a conflict with an active BLE session. */
					if (m_send_sync_pkt && m_tx_slot_retry_count < 3)
					{
						/* Try a few times to skip the next scheduled event, else get earliest possible. */
						++m_tx_slot_retry_count;
						m_timeslot_req_normal.params.normal.distance_us = m_timeslot_distance * 2;

						err = mpsl_timeslot_request(
							session_id,
							&m_timeslot_req_normal);
						if (err) {
							LOG_ERR("mpsl_timeslot_request(earliest)=%d", err);
						}
					}
					else
					{
						err = mpsl_timeslot_request(
							session_id,
							&m_timeslot_req_earliest);
						if (err) {
							LOG_ERR("mpsl_timeslot_request(earliest)=%d", err);
						}
					}

					atomic_add(&m_blocked_cancelled_count, 1);
				}
				break;
			default:
				__ASSERT_NO_MSG(false);
				break;
			}
		}
	}

	return 1;
}

ISR_DIRECT_DECLARE(egu_isr)
{
	if (nrf_egu_event_check(EGU_INST, NRF_EGU_EVENT_TRIGGERED0))
	{
		nrf_egu_event_clear(EGU_INST, NRF_EGU_EVENT_TRIGGERED0);

		m_master_counter_diff = ((struct sync_pkt *) mp_curr_adj_pkt)->counter_val - m_curr_adj_counter;
		atomic_add(&m_used_packet_count, 1);
		atomic_set(&m_last_sync, (m_curr_adj_counter - m_master_counter_diff));

		nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL0, TIME_SYNC_TIMER_MAX_VAL);
		nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL2, 0);

		atomic_clear(&m_timer_update_in_progress);

		if (!m_synchronized)
		{
			m_synchronized = true;

			if (m_callback)
			{
				ts_evt_t evt =
				{
					.type = TS_EVT_SYNCHRONIZED,
				};

				m_callback(&evt);
			}
		}
	}

	if (nrf_egu_event_check(EGU_INST, NRF_EGU_EVENT_TRIGGERED2))
	{
		nrf_egu_event_clear(EGU_INST, NRF_EGU_EVENT_TRIGGERED2);

		nrf_ppi_channel_disable(NRF_PPI, m_params.ppi_chns[4]);

		if (m_callback)
		{
			ts_evt_t trigger_evt =
			{
				.type = TS_EVT_TRIGGERED,
				.params.triggered.tick_target = m_tick_target,
				.params.triggered.last_sync = m_last_sync,
				.params.triggered.sync_packet_count = m_sync_packet_count,
				.params.triggered.used_packet_count = m_used_packet_count,
			};
			m_callback(&trigger_evt);
		}
	}

	if (nrf_egu_event_check(EGU_INST, NRF_EGU_EVENT_TRIGGERED3))
	{
		nrf_egu_event_clear(EGU_INST, NRF_EGU_EVENT_TRIGGERED3);

		if (m_synchronized)
		{
			m_synchronized = false;

			if (m_callback)
			{
				ts_evt_t evt =
				{
					.type = TS_EVT_DESYNCHRONIZED,
				};

				m_callback(&evt);
			}
		}
	}

	if (nrf_egu_event_check(EGU_INST, NRF_EGU_EVENT_TRIGGERED4))
	{
		nrf_egu_event_clear(EGU_INST, NRF_EGU_EVENT_TRIGGERED4);
		// TODO: Remove this event, as it is not currently used
	}

	if (nrf_egu_event_check(EGU_INST, NRF_EGU_EVENT_TRIGGERED5))
	{
		uint64_t timestamp;
		uint32_t counter_val;
		uint32_t timer_val_cc5;
		uint32_t timer_val_cc2;

		nrf_egu_event_clear(EGU_INST, NRF_EGU_EVENT_TRIGGERED5);

		counter_val = nrf_timer_cc_get(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL5);
		timer_val_cc2 = nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL2);
		timer_val_cc5 = nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL5);

		if ((timer_val_cc5 <= 5) || (timer_val_cc5 == TIME_SYNC_TIMER_MAX_VAL) ||
			(timer_val_cc2 != 0 && timer_val_cc5 == timer_val_cc2))
		{
			// Check if counter increment was caught
			nrf_timer_task_trigger(COUNTER_TIMER, NRF_TIMER_TASK_CAPTURE5);
			if (nrf_timer_cc_get(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL5) != counter_val)
			{
				counter_val = nrf_timer_cc_get(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL5);
			}
		}

		timestamp  = counter_val;
		timestamp += m_master_counter_diff;
		timestamp *= TIME_SYNC_TIMER_MAX_VAL;
		timestamp += timer_val_cc5;

		if (m_callback)
		{
			ts_evt_t evt =
			{
				.type = TS_EVT_TIMESTAMP,
				.params.timestamp = timestamp,
			};

			m_callback(&evt);
		}
	}

	return 1;
}

static mpsl_timeslot_signal_return_param_t *mpsl_timeslot_callback(
	mpsl_timeslot_session_id_t session_id,
	uint32_t signal_type)
{
	(void) session_id; /* unused parameter */
	uint8_t input_data = (uint8_t)signal_type;
	uint32_t input_data_len;

	mpsl_timeslot_signal_return_param_t *p_ret_val = NULL;

	switch (signal_type) {

	case MPSL_TIMESLOT_SIGNAL_START:
		nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL0,
			(TS_LEN_US - TS_SAFETY_MARGIN_US));
		nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL1,
			(TS_LEN_US - TS_EXTEND_MARGIN_US));
		if (m_send_sync_pkt) {
			nrf_timer_int_enable(NRF_TIMER0, NRF_TIMER_INT_COMPARE0_MASK);
		} else {
			nrf_timer_int_enable(NRF_TIMER0, NRF_TIMER_INT_COMPARE0_MASK | NRF_TIMER_INT_COMPARE1_MASK);
		}
		nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE0);
		nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE1);
		nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_START);

		timeslot_begin_handler();
		break;
	case MPSL_TIMESLOT_SIGNAL_RADIO:
		timeslot_radio_handler();
		break;
	case MPSL_TIMESLOT_SIGNAL_TIMER0:
		if (nrf_timer_event_check(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE0)) {

			nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE0);
			nrf_timer_int_disable(NRF_TIMER0, NRF_TIMER_INT_COMPARE0_MASK);

			// This is the "timeslot is about to end" timeout

			// Schedule next timeslot
			if (m_send_sync_pkt)
			{
				m_timeslot_req_normal.params.normal.distance_us = m_timeslot_distance;

				signal_callback_return_param.params.request.p_next =
					&m_timeslot_req_normal;
				signal_callback_return_param.callback_action =
					MPSL_TIMESLOT_SIGNAL_ACTION_REQUEST;
			}
			else
			{
				signal_callback_return_param.params.request.p_next =
					&m_timeslot_req_earliest;
				signal_callback_return_param.callback_action =
					MPSL_TIMESLOT_SIGNAL_ACTION_REQUEST;
			}

			timeslot_end_handler();

			p_ret_val = &signal_callback_return_param;
		}

		if (nrf_timer_event_check(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE1)) {

			nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE1);

			// This is the "try to extend timeslot" timeout

			if (m_total_timeslot_length < (128000000UL - 5000UL - TX_LEN_EXTENSION_US) && !m_send_sync_pkt)
			{
				// Request timeslot extension if total length does not exceed 128 seconds

				signal_callback_return_param.params.request.p_next =
					&m_timeslot_req_normal;
				signal_callback_return_param.callback_action =
					MPSL_TIMESLOT_SIGNAL_ACTION_EXTEND;
			}
			else if (!m_send_sync_pkt)
			{
				signal_callback_return_param.params.request.p_next =
					&m_timeslot_req_earliest;
				signal_callback_return_param.callback_action =
					MPSL_TIMESLOT_SIGNAL_ACTION_REQUEST;
			}
		}
		break;
	case MPSL_TIMESLOT_SIGNAL_EXTEND_SUCCEEDED:
		// Extension succeeded: update timer
		{
			uint32_t cc0_val;
			uint32_t cc1_val;

