nordic-auko/nRF5-ble-timesync-demo/ncs/timesync_sample/src/timesync/time_sync_nrf52.c
			cc0_val = nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL0);
			cc1_val = nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL1);

			nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL0, cc0_val + TX_LEN_EXTENSION_US - 25);
			nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL1, cc1_val + TX_LEN_EXTENSION_US - 25);
		}

		// Keep track of total length
		m_total_timeslot_length += TX_LEN_EXTENSION_US;

		increment_desync_timeout(TX_LEN_EXTENSION_US);
		break;
	case MPSL_TIMESLOT_SIGNAL_EXTEND_FAILED:
		timeslot_end_handler();
		increment_desync_timeout(TX_LEN_EXTENSION_US);

		p_ret_val = &signal_callback_return_param;
		signal_callback_return_param.params.request.p_next =
			&m_timeslot_req_earliest;
		signal_callback_return_param.callback_action =
			MPSL_TIMESLOT_SIGNAL_ACTION_REQUEST;
		break;
	case MPSL_TIMESLOT_SIGNAL_SESSION_IDLE:
	case MPSL_TIMESLOT_SIGNAL_SESSION_CLOSED:
	case MPSL_TIMESLOT_SIGNAL_BLOCKED:
	case MPSL_TIMESLOT_SIGNAL_CANCELLED:
		input_data_len = ring_buf_put(&callback_low_priority_ring_buf, &input_data, 1);
		if (input_data_len != 1) {
			LOG_ERR("Full ring buffer, enqueue data with length %d", input_data_len);
			k_oops();
		}
		break;
	default:
		LOG_ERR("unexpected signal: %u", signal_type);
		k_oops();
		break;
	}

#if defined(CONFIG_SOC_SERIES_NRF53X)
	NVIC_SetPendingIRQ(TS_SWI_IRQn);
#elif defined(CONFIG_SOC_SERIES_NRF52X)
	NVIC_SetPendingIRQ(TS_SWI_IRQn);
#endif

	if (p_ret_val == NULL) {
		signal_callback_return_param.callback_action =
			MPSL_TIMESLOT_SIGNAL_ACTION_NONE;
		signal_callback_return_param.params.request.p_next =
					&m_timeslot_req_normal;
		p_ret_val = &signal_callback_return_param;
	}

	return p_ret_val;
}


static void increment_desync_timeout(uint32_t increment_usec)
{
	if (m_send_sync_pkt)
	{
		// No desync as transmitter
		return;
	}

	m_usec_since_sync_packet += increment_usec;
	if (m_usec_since_sync_packet >= TIME_SYNC_DESYNC_TIMEOUT)
	{
		nrf_egu_task_trigger(EGU_INST, NRF_EGU_TASK_TRIGGER3);
		m_usec_since_sync_packet = 0; // Reset to suppress needless irq generation
	}
}

static struct sync_pkt * tx_buf_get(void)
{
    uint32_t idx;

    idx = atomic_inc(&m_sync_pkt_ringbuf_idx) % ARRAY_SIZE(m_sync_pkt_ringbuf);

    return (struct sync_pkt *) m_sync_pkt_ringbuf[idx];
}

static void update_radio_parameters(struct sync_pkt * p_pkt)
{
	const nrf_radio_packet_conf_t pkt_conf = {
		.lflen = 0,
		.s0len = 0,
		.s1len = 0,
		.maxlen = sizeof(struct sync_pkt),
		.statlen = sizeof(struct sync_pkt),
		.balen = 4,
		.big_endian = true,
		.whiteen = true,
#if defined(RADIO_PCNF0_PLEN_Msk)
		.plen = NRF_RADIO_PREAMBLE_LENGTH_16BIT,
#endif
#if defined(RADIO_PCNF0_CRCINC_Msk)
		.crcinc = false,
#endif
#if defined(RADIO_PCNF0_S1INCL_Msk)
		.s1incl = false,
#endif
#if defined(RADIO_PCNF0_CILEN_Msk)
		.cilen = 0,
#endif
#if defined(RADIO_PCNF0_TERMLEN_Msk)
		.termlen = 0,
#endif
	};

	nrf_radio_power_set(NRF_RADIO, true);
	nrf_radio_txpower_set(NRF_RADIO, NRF_RADIO_TXPOWER_0DBM);
	nrf_radio_mode_set(NRF_RADIO, NRF_RADIO_MODE_NRF_2MBIT);
	nrf_radio_modecnf0_set(NRF_RADIO, true, RADIO_MODECNF0_DTX_Center);
	nrf_radio_crc_configure(NRF_RADIO, 3, NRF_RADIO_CRC_ADDR_INCLUDE, 0x11021UL);
	nrf_radio_crcinit_set(NRF_RADIO, 0xFFFFFFUL);
	nrf_radio_packet_configure(NRF_RADIO, &pkt_conf);
	nrf_radio_packetptr_set(NRF_RADIO, p_pkt);
	nrf_radio_base0_set(NRF_RADIO,
		m_params.rf_addr[1] << 24 | m_params.rf_addr[2] << 16 |
		m_params.rf_addr[3] << 8 | m_params.rf_addr[4]);
	nrf_radio_prefix0_set(NRF_RADIO, m_params.rf_addr[0]);
	nrf_radio_txaddress_set(NRF_RADIO, 0);
	nrf_radio_rxaddresses_set(NRF_RADIO, BIT(0));
	nrf_radio_frequency_set(NRF_RADIO, 2400 + m_params.rf_chn);
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_END);
	nrf_radio_int_disable(NRF_RADIO, 0xFFFFFFFF);
	nrf_radio_int_enable(NRF_RADIO, NRF_RADIO_INT_END_MASK);

	NVIC_SetPriority(RADIO_IRQn, MPSL_HIGH_IRQ_PRIORITY);
	NVIC_ClearPendingIRQ(RADIO_IRQn);
	NVIC_EnableIRQ(RADIO_IRQn);
}

void timeslot_end_handler(void)
{
	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
	nrf_radio_int_disable(NRF_RADIO, 0xFFFFFFFF);

	ppi_radio_rx_disable();
	nrf_radio_power_set(NRF_RADIO, false);
	NVIC_DisableIRQ(RADIO_IRQn);
	NVIC_ClearPendingIRQ(RADIO_IRQn);

	m_radio_state = RADIO_STATE_IDLE;
}

void timeslot_begin_handler(void)
{
	struct sync_pkt * p_pkt;

	m_total_timeslot_length = 0;
	m_tx_slot_retry_count = 0;

	if (m_pending_tx_stop)
	{
		atomic_clear(&m_send_sync_pkt);
		atomic_clear(&m_pending_tx_stop);
		m_timeslot_distance = 0;
		m_synchronized = false;
	}

	if (!m_send_sync_pkt)
	{
		if (m_radio_state    != RADIO_STATE_RX ||
			nrf_radio_state_get(NRF_RADIO) != NRF_RADIO_STATE_RX)
		{
			p_pkt = tx_buf_get();

			update_radio_parameters(p_pkt);

			nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK);
			nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_RXEN);

			ppi_radio_rx_configure();

			m_radio_state = RADIO_STATE_RX;
		}

		return;
	}

	if (m_radio_state == RADIO_STATE_RX)
	{
		// Packet transmission has now started (state change from RX).
		nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_DISABLED);
		nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
		while (!nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_DISABLED)) {
			__NOP();
		}
	}

	p_pkt = tx_buf_get();

	ppi_radio_tx_configure();
	update_radio_parameters(p_pkt);

	nrf_radio_shorts_enable(NRF_RADIO,
		NRF_RADIO_SHORT_READY_START_MASK | NRF_RADIO_SHORT_END_DISABLE_MASK);
	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_TXEN);

	while (!nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_READY)) {
		// PPI is used to trigger sync timer capture when radio is ready
		// Radio will automatically start transmitting once ready, so the captured timer value must be copied into radio packet buffer ASAP
		__NOP();
	}

	p_pkt->timer_val   = nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL1);
	p_pkt->counter_val = nrf_timer_cc_get(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL1);
	p_pkt->counter_val += m_master_counter_diff;

	atomic_add(&m_sync_packet_count, 1);
	m_radio_state = RADIO_STATE_TX;
}

static void timeslot_radio_handler(void)
{

	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_END);

