nordic-auko/nRF5-ble-timesync-demo/ncs/timesync_sample/src/timesync/time_sync_nrf52.c
	if (m_radio_state == RADIO_STATE_RX && nrf_radio_crc_status_check(NRF_RADIO)) {
		struct sync_pkt * p_pkt;
		bool         adjustment_procedure_started;

		// LOG_INF("RX");

		p_pkt = (struct sync_pkt *) nrf_radio_packetptr_get(NRF_RADIO);

		if (p_pkt->timer_val <= 2)
		{
			// Ignore packet due to potential missed counter increment
			// TODO: See if this can be tightened
			goto resume_radio_rx;
		}


		adjustment_procedure_started = sync_timer_offset_compensate(p_pkt);
		atomic_add(&m_sync_packet_count, 1);

		if (adjustment_procedure_started)
		{
			atomic_set(&m_prev_sync_pkt_timer, p_pkt->timer_val); // TODO: Necessary?
			atomic_set(&m_prev_sync_pkt_counter, p_pkt->counter_val); // TODO: Necessary?

			p_pkt = tx_buf_get();

			nrf_radio_packetptr_set(NRF_RADIO, p_pkt);

			m_usec_since_sync_packet = 0;
		}

		atomic_add(&m_rcv_count, 1);
	}

resume_radio_rx:

	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_START);
}

static void timestamp_counter_start(void)
{
	// COUNTER_TIMER is used in counter mode to count the number of sync timer overflows/resets
	// When timestamp API is used, the number of overflows/resets + current value of sync timer must be added up to give accurate timestamp information
	nrf_timer_task_trigger(COUNTER_TIMER, NRF_TIMER_TASK_STOP);
	nrf_timer_task_trigger(COUNTER_TIMER, NRF_TIMER_TASK_CLEAR);
	nrf_timer_prescaler_set(COUNTER_TIMER, NRF_TIMER_FREQ_16MHz);
	nrf_timer_mode_set(COUNTER_TIMER, NRF_TIMER_MODE_COUNTER);
	nrf_timer_bit_width_set(COUNTER_TIMER, NRF_TIMER_BIT_WIDTH_32);
	nrf_timer_task_trigger(COUNTER_TIMER, NRF_TIMER_TASK_START);
}

static void sync_timer_start(void)
{
	// FREEWHEEL_TIMER (NRF_TIMER) is the always-running sync timer
	// The timing master never adjusts this timer
	// The timing slave(s) adjusts this timer whenever a sync packet is received and the logic determines that there is
	nrf_timer_task_trigger(FREEWHEEL_TIMER, NRF_TIMER_TASK_STOP);
	nrf_timer_task_trigger(FREEWHEEL_TIMER, NRF_TIMER_TASK_CLEAR);
	nrf_timer_prescaler_set(FREEWHEEL_TIMER, NRF_TIMER_FREQ_16MHz);
	nrf_timer_mode_set(FREEWHEEL_TIMER, NRF_TIMER_MODE_TIMER);
	nrf_timer_bit_width_set(FREEWHEEL_TIMER, NRF_TIMER_BIT_WIDTH_32);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL0, TIME_SYNC_TIMER_MAX_VAL);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL1, 0xFFFFFFFF);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL2, 0xFFFFFFFF);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL3, 0xFFFFFFFF);
	nrf_timer_task_trigger(FREEWHEEL_TIMER, NRF_TIMER_TASK_START);
}

int ts_set_trigger(uint32_t target_tick, uint32_t ppi_endpoint)
{
	if (!m_timeslot_session_open)
	{
		return -EBUSY;
	}

	if (ppi_sync_trigger_configure(ppi_endpoint) != 0)
	{
		return -EINVAL;
	}

	atomic_set(&m_sync_packet_count, 0);
	atomic_set(&m_used_packet_count, 0);

	// TODO: is there a way to check if the target value is plausible?

	nrf_timer_cc_set(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL4, (target_tick - m_master_counter_diff));
	atomic_set(&m_tick_target, target_tick);
	nrf_ppi_channel_enable(NRF_PPI, m_params.ppi_chns[4]); // activate trigger
	return 0;
}

int ts_set_timestamp_trigger(uint32_t ppi_event_endpoint)
{
	// TODO: Check if other timers can be used also
	if (FREEWHEEL_TIMER != NRF_TIMER3 && FREEWHEEL_TIMER != NRF_TIMER4)
	{
		return -EBUSY;
	}
	if (COUNTER_TIMER != NRF_TIMER3 && COUNTER_TIMER != NRF_TIMER4)
	{
		return -EBUSY;
	}

	if (!m_timestamp_trigger_set)
	{
		nrfx_err_t err;

		for (int i = 0; i < ARRAY_SIZE(m_timestamp_trigger_ppi); ++i)
		{
			err = nrfx_ppi_channel_alloc(&m_timestamp_trigger_ppi[i]);
			if (err != NRFX_SUCCESS)
			{
				return err;
			}
		}
	}

	ppi_counter_timer_triggered_capture_configure(m_timestamp_trigger_ppi, ppi_event_endpoint);

	m_timestamp_trigger_set = true;

	return 0;
}

static inline bool sync_timer_offset_compensate(struct sync_pkt * p_pkt)
{
	uint32_t peer_timer;
	uint32_t local_timer;
	int32_t timer_offset;
	bool wrapped = false;

	if (atomic_set(&m_timer_update_in_progress, true))
	{
		return false;
	}

	peer_timer  = p_pkt->timer_val;
	peer_timer += TX_CHAIN_DELAY;
	if (peer_timer >= TIME_SYNC_TIMER_MAX_VAL)
	{
		peer_timer -= TIME_SYNC_TIMER_MAX_VAL;
		p_pkt->counter_val += 1;
		wrapped = true;
	}

	local_timer = nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL1);
	timer_offset = local_timer - peer_timer;

	if (local_timer > TIME_SYNC_TIMER_MAX_VAL)
	{
		// Todo: Investigate if this is a corner case with a root cause that needs to be handled
		atomic_clear(&m_timer_update_in_progress);
		return false;
	}

	if (timer_offset == TIME_SYNC_TIMER_MAX_VAL || timer_offset == 0)
	{
		// Already in sync
		atomic_add(&m_used_packet_count, 1);
		atomic_clear(&m_timer_update_in_progress);
		return false;
	}

	if (wrapped && (local_timer >= (TIME_SYNC_TIMER_MAX_VAL - 50)))
	{
		// Too close
		// Todo: see if local counter increment can be accounted for
		atomic_clear(&m_timer_update_in_progress);
		return false;
	}

	bool shorten_cycle = timer_offset < 0;

	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL2, (TIME_SYNC_TIMER_MAX_VAL + timer_offset));
	ppi_sync_timer_adjust_configure(shorten_cycle);

	atomic_set(&mp_curr_adj_pkt, (uint32_t) p_pkt);

	atomic_set(&m_curr_adj_timer, nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL1));
	atomic_set(&m_curr_adj_counter, nrf_timer_cc_get(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL1));

	uint32_t cc_val;

	do
	{
		// Avoid race condition when disabling and re-enabling PPI channel very quickly
		nrf_timer_task_trigger(FREEWHEEL_TIMER, NRF_TIMER_TASK_CAPTURE4);
		cc_val = nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL4);
	} while ((cc_val > (TIME_SYNC_TIMER_MAX_VAL - 15)));

	if (shorten_cycle)
	{
		nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL0, (TIME_SYNC_TIMER_MAX_VAL + 10));
		ppi_sync_timer_adjust_enable();
	}
	else
	{
		ppi_sync_timer_adjust_enable();
		ppi_sync_timer_clear_disable();
	}

	return true;
}

static void ppi_sync_timer_adjust_configure(bool shorten)
{
	nrf_ppi_channel_t chn0, chn1, chn2;
	nrf_ppi_channel_group_t chg0, chg1;

