nordic-auko/nRF5-ble-timesync-demo/ncs/timesync_sample/src/timesync/time_sync_nrf52.c
	chn0 = m_params.ppi_chns[0];
	chn1 = m_params.ppi_chns[1];
	chn2 = m_params.ppi_chns[6];
	chg0  = m_params.ppi_chgs[0];
	chg1  = m_params.ppi_chgs[1];

	// PPI channel 0: clear timer when compare[2] value is reached

	nrf_ppi_channel_disable(NRF_PPI, chn0);

	nrf_ppi_channel_endpoint_setup(NRF_PPI, chn0,
		nrf_timer_event_address_get(FREEWHEEL_TIMER, NRF_TIMER_EVENT_COMPARE2),
		nrf_timer_task_address_get(FREEWHEEL_TIMER, NRF_TIMER_TASK_CLEAR));
	if (shorten)
	{
		nrf_ppi_fork_endpoint_setup(NRF_PPI, chn0,
			nrf_timer_task_address_get(COUNTER_TIMER, NRF_TIMER_TASK_COUNT));
	}
	else
	{
		nrf_ppi_fork_endpoint_setup(NRF_PPI, chn0, 0);
	}

	// PPI channel 1: disable PPI channel 0 such that the timer is only reset once, and trigger software interrupt
	nrf_ppi_channel_disable(NRF_PPI, chn1);
	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn1,
		nrf_timer_event_address_get(FREEWHEEL_TIMER, NRF_TIMER_EVENT_COMPARE2),
		nrf_ppi_task_group_disable_address_get(NRF_PPI, chg0),
		nrf_egu_task_address_get(EGU_INST, NRF_EGU_TASK_TRIGGER0));

	nrf_ppi_channel_disable(NRF_PPI, chn2);

	if (shorten)
	{
		nrf_ppi_channel_endpoint_setup(NRF_PPI, chn2, 0, 0);
	}
	else
	{
		// PPI channel 2: Re-enable EVENTS_COMPARE[0] after lengthening cycle
		nrf_ppi_channel_endpoint_setup(NRF_PPI, chn2,
			nrf_timer_event_address_get(FREEWHEEL_TIMER, NRF_TIMER_EVENT_COMPARE2),
			nrf_ppi_task_group_enable_address_get(NRF_PPI, chg1));
	}

	nrf_ppi_group_disable(NRF_PPI, chg0);
	nrf_ppi_channels_include_in_group(NRF_PPI,
		BIT(chn0) | BIT(chn1) | BIT(chn2),
		chg0);
}

static void ppi_radio_rx_configure(void)
{
	uint32_t chn;

	chn = m_params.ppi_chns[2];

	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn,
		nrf_radio_event_address_get(NRF_RADIO, NRF_RADIO_EVENT_ADDRESS),
		nrf_timer_task_address_get(FREEWHEEL_TIMER, NRF_TIMER_TASK_CAPTURE1),
		nrf_timer_task_address_get(COUNTER_TIMER, NRF_TIMER_TASK_CAPTURE1));
	nrf_ppi_channel_enable(NRF_PPI, chn);
}

static void ppi_radio_tx_configure(void)
{
	uint32_t chn;

	chn = m_params.ppi_chns[0];

	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn,
		nrf_radio_event_address_get(NRF_RADIO, NRF_RADIO_EVENT_READY),
		nrf_timer_task_address_get(FREEWHEEL_TIMER, NRF_TIMER_TASK_CAPTURE1),
		nrf_timer_task_address_get(COUNTER_TIMER, NRF_TIMER_TASK_CAPTURE1));
	nrf_ppi_channel_enable(NRF_PPI, chn);
}

static void ppi_timestamp_timer_configure(void)
{
	uint32_t chn;

	chn = m_params.ppi_chns[3];

	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn,
		nrf_timer_event_address_get(FREEWHEEL_TIMER, NRF_TIMER_EVENT_COMPARE0),
		nrf_timer_task_address_get(COUNTER_TIMER, NRF_TIMER_TASK_COUNT),
		0);
	nrf_ppi_channel_enable(NRF_PPI, chn);
}

static void ppi_counter_timer_capture_configure(uint32_t chn)
{
	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn,
		nrf_egu_event_address_get(EGU_INST, NRF_EGU_EVENT_TRIGGERED1),
		nrf_timer_task_address_get(FREEWHEEL_TIMER, NRF_TIMER_TASK_CAPTURE3),
		nrf_timer_task_address_get(COUNTER_TIMER, NRF_TIMER_TASK_CAPTURE0));
	nrf_ppi_channel_enable(NRF_PPI, chn);
}

static void ppi_counter_timer_triggered_capture_configure(nrf_ppi_channel_t chn[2], uint32_t eep)
{
	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn[0],
		eep,
		nrf_timer_task_address_get(FREEWHEEL_TIMER, NRF_TIMER_TASK_CAPTURE5),
		nrf_timer_task_address_get(COUNTER_TIMER, NRF_TIMER_TASK_CAPTURE5));

	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn[1],
		eep,
		nrf_egu_task_address_get(EGU_INST, NRF_EGU_TASK_TRIGGER5),
		0);

	nrf_ppi_channels_enable(NRF_PPI, BIT(chn[0]) | BIT(chn[1]));
}

static void ppi_counter_timer_capture_disable(uint32_t chn)
{
	nrf_ppi_channel_disable(NRF_PPI, chn);

	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, chn, 0, 0, 0);
}

static void ppi_radio_rx_disable(void)
{
	nrf_ppi_channel_disable(NRF_PPI, m_params.ppi_chns[2]);
}

static void ppi_sync_timer_adjust_enable(void)
{
	nrf_ppi_group_enable(NRF_PPI, m_params.ppi_chgs[0]);
}

static void ppi_sync_timer_clear_configure(void)
{
	uint32_t chn;
	uint32_t chg;

	chn = m_params.ppi_chns[5];
	chg = m_params.ppi_chgs[1];

	nrf_ppi_channel_disable(NRF_PPI, chn);
	nrf_ppi_channel_endpoint_setup(NRF_PPI, chn,
		nrf_timer_event_address_get(FREEWHEEL_TIMER, NRF_TIMER_EVENT_COMPARE0),
		nrf_timer_task_address_get(FREEWHEEL_TIMER, NRF_TIMER_TASK_CLEAR));
	nrf_ppi_channel_enable(NRF_PPI, chn);

	nrf_ppi_channel_include_in_group(NRF_PPI, chn, chg);
	nrf_ppi_group_enable(NRF_PPI, chg);
}

static void ppi_sync_timer_clear_disable(void)
{
	nrf_ppi_group_disable(NRF_PPI, m_params.ppi_chgs[1]);
}

int ppi_sync_trigger_configure(uint32_t ppi_endpoint)
{

	nrf_ppi_channel_and_fork_endpoint_setup(NRF_PPI, m_params.ppi_chns[4],
		nrf_timer_event_address_get(COUNTER_TIMER, NRF_TIMER_EVENT_COMPARE4),
		ppi_endpoint,
		nrf_egu_task_address_get(EGU_INST, NRF_EGU_TASK_TRIGGER2));

	return 0;
}

static void timers_capture(uint32_t * p_sync_timer_val, uint32_t * p_count_timer_val, int32_t * p_peer_counter_diff)
{
	static atomic_t m_timestamp_capture_flag = 0;

	volatile int32_t peer_counter_diff;

	if (atomic_set(&m_timestamp_capture_flag, true) != 0)
	{
		// Not thread-safe
		__ASSERT_NO_MSG(false);
	}

	nrf_ppi_channel_t ppi_chn;
	nrfx_err_t ret = nrfx_ppi_channel_alloc(&ppi_chn);
	__ASSERT_NO_MSG(ret == NRFX_SUCCESS);
	(void)ret; /* If CONFIG_ASSERT is not set, ret is unused. */

	ppi_counter_timer_capture_configure(ppi_chn);

	// Loop if adjustment procedure happened close to timer capture
	do
	{
		NVIC_DisableIRQ(TS_EGU_IRQn);

		nrf_egu_event_clear(EGU_INST, NRF_EGU_EVENT_TRIGGERED1);
		nrf_egu_task_trigger(EGU_INST, NRF_EGU_TASK_TRIGGER1);
		while (!nrf_egu_event_check(EGU_INST, NRF_EGU_EVENT_TRIGGERED1))
		{
			__NOP();
		}

		peer_counter_diff = m_master_counter_diff;

		NVIC_EnableIRQ(TS_EGU_IRQn);
	} while (nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL3) < 2);


	ppi_counter_timer_capture_disable(ppi_chn);
	nrfx_ppi_channel_free(ppi_chn);

	*p_sync_timer_val = nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL3);
	*p_count_timer_val = nrf_timer_cc_get(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL0);
	*p_peer_counter_diff = peer_counter_diff;

	atomic_clear(&m_timestamp_capture_flag);
}

int ts_init(ts_evt_handler_t evt_handler)
{
	nrfx_err_t ret;

	m_callback = evt_handler;

