nordic-auko/nRF5-ble-timesync-demo/ncs/timesync_sample/src/timesync/time_sync_nrf52.c
	for (size_t i = 0; i < sizeof(m_params.ppi_chgs) / sizeof(m_params.ppi_chgs[0]); i++)
	{
		ret = nrfx_ppi_group_alloc(&m_params.ppi_chgs[i]);
		if (ret != NRFX_SUCCESS)
		{
			return -EBUSY;
		}
	}

	for (size_t i = 0; i < sizeof(m_params.ppi_chns) / sizeof(m_params.ppi_chns[0]); i++)
	{
		ret = nrfx_ppi_channel_alloc(&m_params.ppi_chns[i]);
		if (ret != NRFX_SUCCESS)
		{
			return -EBUSY;
		}
	}

	IRQ_DIRECT_CONNECT(TS_SWI_IRQn, 1, swi_isr, 0);
	irq_enable(TS_SWI_IRQn);
	IRQ_DIRECT_CONNECT(TS_EGU_IRQn, TIME_SYNC_EVT_HANDLER_IRQ_PRIORITY, egu_isr, 0);
	irq_enable(TS_EGU_IRQn);

	// TODO: Implement use of RTC as a low-power (and lower accuracy)
	// alternative to 16 MHz TIMER
	// if (SYNC_RTC_PRESCALER != m_params.rtc->PRESCALER)
	// {
	//     // TODO: Handle this
	//     return -EBUSY;
	// }

	return 0;
}

int ts_enable(const ts_rf_config_t* p_rf_config)
{
	int err;

	if (p_rf_config == NULL)
	{
		return -EINVAL;
	}

	if (m_timeslot_session_open)
	{
		return -EBUSY;
	}

	/* Enable crystal oscillator for improved clock accuracy */
	clk_mgr = z_nrf_clock_control_get_onoff(CLOCK_CONTROL_NRF_SUBSYS_HF);
	if (!clk_mgr) {
		return -ENODEV;
	}

	sys_notify_init_spinwait(&clk_cli.notify);

	err = onoff_request(clk_mgr, &clk_cli);
	if (err < 0) {
		LOG_ERR("onoff_request: %d", err);
		return err;
	}

	/* Enable constant latency mode to minimize jitter */
	nrf_power_task_trigger(NRF_POWER, NRF_POWER_TASK_CONSTLAT);

	memcpy(m_params.rf_addr, p_rf_config->rf_addr, sizeof(m_params.rf_addr));
	m_params.rf_chn = p_rf_config->rf_chn;

	ppi_timestamp_timer_configure();

	// NVIC_ClearPendingIRQ(EGU_INST_irq_type);
	// NVIC_SetPriority(EGU_INST_irq_type, TIME_SYNC_EVT_HANDLER_IRQ_PRIORITY);
	// NVIC_EnableIRQ(EGU_INST_irq_type);

	nrf_egu_int_disable(EGU_INST, NRF_EGU_INT_ALL);
	nrf_egu_int_enable(EGU_INST,
		NRF_EGU_INT_TRIGGERED0 |
		NRF_EGU_INT_TRIGGERED2 |
		NRF_EGU_INT_TRIGGERED3 |
		NRF_EGU_INT_TRIGGERED4 |
		NRF_EGU_INT_TRIGGERED5);

	m_blocked_cancelled_count  = 0;
	m_radio_state              = RADIO_STATE_IDLE;

	atomic_clear(&m_send_sync_pkt);

	timestamp_counter_start();
	ppi_sync_timer_clear_configure();
	sync_timer_start();

	err = mpsl_timeslot_session_open(
		mpsl_timeslot_callback,
		&session_id);
	if (err) {
		LOG_ERR("mpsl_timeslot_session_open=%d", err);
		return err;
	}

	err = mpsl_timeslot_request(
		session_id,
		&m_timeslot_req_earliest);
	if (err) {
		LOG_ERR("mpsl_timeslot_request(earliest)=%d", err);
		return err;
	}

	atomic_set(&m_timeslot_session_open, true);

	return 0;
}

int ts_disable(void)
{
	int err;

	atomic_set(&m_pending_close, true);

	err = mpsl_timeslot_session_close(session_id);
	if (err) {
		LOG_ERR("mpsl_timeslot_session_close=%d", err);
		return err;
	}

	// TODO: stop timer

	nrf_power_task_trigger(NRF_POWER, NRF_POWER_TASK_LOWPWR);

	err = onoff_release(clk_mgr);
	if (err < 0) {
		LOG_ERR("onoff_release: %d", err);
		return err;
	}

	// TODO:
	//       - Close SoftDevice radio session (sd_radio_session_close())
	//       - Stop radio activity
	//       - Stop timers
	//       - Disable used PPI channels
	//       - Disable used interrupts
	//       - Release HFCLK (sd_clock_hfclk_release()),
	//       - Go back to low-power (mode sd_power_mode_set(NRF_POWER_MODE_LOWPWR))
	// Care must be taken to ensure clean stop. Order of tasks above should be reconsidered.
	return 0;
}

int ts_tx_start(uint32_t sync_freq_hz)
{
	uint32_t distance;

	if (sync_freq_hz == TIME_SYNC_FREQ_AUTO)
	{
		// 20-30 Hz is a good range
		// Higher frequency gives more margin for missed packets, but doesn't improve accuracy that much
		uint32_t auto_freq_target = 25;
		distance = (NRFX_ROUNDED_DIV(NRFX_ROUNDED_DIV(1000000, auto_freq_target), (TIME_SYNC_TIMER_MAX_VAL / 16))) * (TIME_SYNC_TIMER_MAX_VAL / 16);
	}
	else
	{
		distance = (1000000 / sync_freq_hz);
	}

	if (distance >= MPSL_TIMESLOT_DISTANCE_MAX_US)
	{
		return -EINVAL;
	}

	m_timeslot_distance = distance;
	m_usec_since_tx_offset_calc = 0;

	atomic_set(&m_send_sync_pkt, true);

	return 0;
}

int ts_tx_stop()
{
	atomic_set(&m_pending_tx_stop, true);

	return 0;
}

uint32_t ts_timestamp_get_ticks_u32(void)
{
	uint32_t sync_timer_val;
	uint32_t count_timer_val;
	int32_t peer_diff;

	timers_capture(&sync_timer_val, &count_timer_val, &peer_diff);

	return (((count_timer_val + peer_diff) * TIME_SYNC_TIMER_MAX_VAL) + sync_timer_val);
}

uint64_t ts_timestamp_get_ticks_u64(void)
{
	uint32_t sync_timer_val;
	uint32_t count_timer_val;
	uint64_t timestamp;
	int32_t  peer_diff;

	timers_capture(&sync_timer_val, &count_timer_val, &peer_diff);

	timestamp  = (uint64_t) count_timer_val;
	timestamp += (uint64_t) peer_diff;
	timestamp *= TIME_SYNC_TIMER_MAX_VAL;
	timestamp += (uint64_t) sync_timer_val;

	return timestamp;
}
